       IDENTIFICATION DIVISION.
       PROGRAM-ID. MYPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  ASTRING.
           05 FILLER PIC X(5) VALUE 'BILLO'.
           05 FILLER PIC X    VALUE X'00'.
       01  ULTIMATEANSWER  PIC S9(8) COMP VALUE 42.
       01  MYCOUNT  PIC S9(8) COMP VALUE 777.
       01  RESULT       PIC S9(8) COMP VALUE 0.

       PROCEDURE DIVISION.
           DISPLAY "in MYPROG".
           CALL "SUBPROG" USING ASTRING ULTIMATEANSWER MYCOUNT. 
           GOBACK. 
