       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG.
       DATA DIVISION.
       LINKAGE SECTION.
       01  ASTRING.
           05 FILLER PIC X(5).
           05 FILLER PIC X.
       01  ULTIMATEANSWER  PIC S9(8) COMP.
       01  MYCOUNT  PIC S9(8) COMP.
       PROCEDURE DIVISION USING ASTRING ULTIMATEANSWER MYCOUNT. 
           DISPLAY "in PROCEDURE division"
           DISPLAY "ASTRING " ASTRING.
           DISPLAY "ANSWER TO THE ULTIMATE QUESTION " ULTIMATEANSWER.
           DISPLAY "MYCOUNT " MYCOUNT.
           GOBACK. 
